MRF_simulation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	wall-downflow
    {
        type            zeroGradient;
    }

    wall-stator
    {
        type            zeroGradient;
    }

    inflow-downflow
    {
        type            zeroGradient;
    }
	
	inflow-stator
	{
		type			zeroGradient;
	}
	
	wall-rotor
	{
		type			zeroGradient;
	}
	
	blade
	{
		type			noSlip;
	}
	
}


// ************************************************************************* //
