MRF_simulation/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0495;

boundaryField
{
	wall-downflow
    {
        type            fixedValue;
		value			uniform 0.0495;
    }

    wall-stator
    {
        type            fixedValue;
        value           uniform 0.0495;
    }

    inflow-downflow
    {
        type            fixedValue;
		value			uniform 0.0495;
    }
	
	inflow-stator
	{
		type			fixedValue;
		value			uniform 0.0495;
	}
	
	wall-rotor
	{
		type			fixedValue;
		value			uniform 0.0495;
	}
	
	blade
	{
		type			epsilonWallFunction;
		value			$internalField;
	}

}


// ************************************************************************* //
