MRF_simulation/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	wall-downflow
    {
        type            zeroGradient;
    }

    wall-stator
    {
        type            zeroGradient;
    }

    inflow-downflow
    {
        type            zeroGradient;
    }
	
	inflow-stator
	{
		type			zeroGradient;
	}
	
	wall-rotor
	{
		type			zeroGradient;
	}
	
	blade
	{
		type			nutkWallFunction;
		value			uniform 0;
	}
	
}


// ************************************************************************* //
